---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OpeningType
source: html/7c6789d3-ff03-7eeb-dcb3-00fa7347d0b3.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OpeningType Property

The analytical opening type.

## Syntax (C#)
```csharp
public EnergyAnalysisOpeningType OpeningType { get; }
```